app/views/organisations/index.html.erb

                <i class="fa fa-users fa-4x"></i>
                <h1 class="m-xs"><%= current_organisation.membershipdata.count %></h1>
---
SELECT COUNT(*) FROM "membershipdata" WHERE "membershipdata"."organisation_id" = $1  [["organisation_id", 6]]

                <i class="fa fa-money fa-4x"></i>
                <h1 class="m-xs"><%= current_organisation.fundraisings.count %></h1>
---
SELECT COUNT(*) FROM "fundraisings" WHERE "fundraisings"."organisation_id" = $1  [["organisation_id", 6]]

                <i class="fa fa-magic fa-4x"></i>
                <h1 class="m-xs"><%= current_organisation.events.count %></h1>
---
SELECT COUNT(*) FROM "events" WHERE "events"."organisation_id" = $1  [["organisation_id", 6]]