app/controllers/announcements_controller.rb

  def index
    @announcements = current_organisation.announcements.all
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."organisation_id" = $1  [["organisation_id", 7]]