app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."organisation_id" = $1  [["organisation_id", 7]]
---
  def index
    #byebug
    @events = current_organisation.events.all