app/controllers/groups_controller.rb

  def index
     @group_announcements = current_organisation.announcements.all
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."organisation_id" = $1  [["organisation_id", 7]]

  def events
     @group_events = current_organisation.events.all
---
SELECT "events".* FROM "events" WHERE "events"."organisation_id" = $1  [["organisation_id", 7]]

  def skills
    @group_skills = current_organisation.users.all
---
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."organisation_id" = $1  [["organisation_id", 7]]