app/controllers/organisations_controller.rb

  def join
    organisation = Organisation.find_by(id: params[:id])
    puts '@' * 300
    puts organisation
    if organisation
      user = User.new(email: params[:email], password: params[:password])
      if user.save
        user.groups << Group.new(user: user, organisation: organisation)
---
SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 ORDER BY "organisations"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "groups" ("created_at", "updated_at", "user_id", "organisation_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-08-01 22:04:40.854763"], ["updated_at", "2017-08-01 22:04:40.854763"], ["user_id", 8], ["organisation_id", 1]]

 def invite
   @organisation = Organisation.find_by(id: params[:id])
---
SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]