app/controllers/users_controller.rb

   def skills
    @skills = User.all
---
SELECT "users".* FROM "users"

   def memberprofiles
     @memberprofiles = User.all
---
SELECT "users".* FROM "users"

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "first_name" = $1, "phone_number" = $2, "profession" = $3, "education" = $4, "skills" = $5, "YearGroup" = $6, "updated_at" = $7 WHERE "users"."id" = $8